Tekla.Structures.AnalysisInternal.DotClientId
DO NOT USE! For internal usage only!

Tekla.Structures.AnalysisInternal.DotClientId.ProcessId
The identifier of the process.

Tekla.Structures.AnalysisInternal.DotClientId.ThreadId
The identifier of the thread.